---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IdParam
source: html/81faa47c-60f0-c6a5-f46f-e14cff1584f3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IdParam Property

"Id"

## Syntax (C#)
```csharp
public static ForgeTypeId IdParam { get; }
```